[Killed] BlockStatement
src/query/ends_with.js:27:58
  * v.endsWith('Murphy', 'ph', 5);
  * // => true
  */
-export default function endsWith(subject, end, position) {
-  if (isNil(end)) {
-    return false;
-  }
-  const subjectString = coerceToString(subject);
-  const endString = coerceToString(end);
-  if (endString === '') {
-    return true;
-  }
-  position = isNil(position) ? subjectString.length : clipNumber(toInteger(position), 0, subjectString.length);
-  position -= endString.length;
-  const lastIndex = subjectString.indexOf(endString, position);
-  return lastIndex !== -1 && lastIndex === position;
-}
+export default function endsWith(subject, end, position) {}
 
killedBy: endsWith should return true for valid ending string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/query/ends_with.js:28:19
  * // => true
  */
 export default function endsWith(subject, end, position) {
-  if (isNil(end)) {
-    return false;
-  }
+  if (isNil(end)) {}
   const subjectString = coerceToString(subject);
   const endString = coerceToString(end);
killedBy: endsWith should return false for undefined and null parameters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/query/ends_with.js:28:7
  * // => true
  */
 export default function endsWith(subject, end, position) {
-  if (isNil(end)) {
+  if (false) {
     return false;
   }
killedBy: endsWith should return false for undefined and null parameters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/query/ends_with.js:29:12
  */
 export default function endsWith(subject, end, position) {
   if (isNil(end)) {
-    return false;
+    return true;
   }
   const subjectString = coerceToString(subject);
killedBy: endsWith should return false for undefined and null parameters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/query/ends_with.js:33:7
   }
   const subjectString = coerceToString(subject);
   const endString = coerceToString(end);
-  if (endString === '') {
+  if (true) {
     return true;
   }
killedBy: endsWith should return false for an invalid ending string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/query/ends_with.js:33:7
   }
   const subjectString = coerceToString(subject);
   const endString = coerceToString(end);
-  if (endString === '') {
+  if (endString !== '') {
     return true;
   }
killedBy: endsWith should return false for an invalid ending string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/query/ends_with.js:34:12
   const subjectString = coerceToString(subject);
   const endString = coerceToString(end);
   if (endString === '') {
-    return true;
+    return false;
   }
   position = isNil(position) ? subjectString.length : clipNumber(toInteger(position), 0, subjectString.length);
killedBy: endsWith should return true for valid ending string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] AssignmentOperator
src/query/ends_with.js:37:3
     return true;
   }
   position = isNil(position) ? subjectString.length : clipNumber(toInteger(position), 0, subjectString.length);
-  position -= endString.length;
+  position += endString.length;
   const lastIndex = subjectString.indexOf(endString, position);
   return lastIndex !== -1 && lastIndex === position;
killedBy: endsWith should return true for valid ending string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/query/ends_with.js:39:10
   position = isNil(position) ? subjectString.length : clipNumber(toInteger(position), 0, subjectString.length);
   position -= endString.length;
   const lastIndex = subjectString.indexOf(endString, position);
-  return lastIndex !== -1 && lastIndex === position;
+  return lastIndex !== -1 || lastIndex === position;
 }
 
killedBy: endsWith should return false for an invalid ending string and position
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/query/ends_with.js:39:10
   position = isNil(position) ? subjectString.length : clipNumber(toInteger(position), 0, subjectString.length);
   position -= endString.length;
   const lastIndex = subjectString.indexOf(endString, position);
-  return lastIndex !== -1 && lastIndex === position;
+  return true;
 }
 
killedBy: endsWith should return false for an invalid ending string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
