[Killed] ConditionalExpression
src/manipulate/replace_all.js:24:7
  */
 export default function replaceAll(subject, search, replace) {
   const subjectString = coerceToString(subject);
-  if (search instanceof RegExp) {
+  if (true) {
     if (search.flags.indexOf('g') === -1) {
       throw new TypeError('search argument is a non-global regular expression');
killedBy: replaceAll should return the replace result with a string pattern
statusReason: TypeError: Cannot read properties of undefined (reading 'indexOf')

[Killed] BlockStatement
src/manipulate/replace_all.js:24:33
  */
 export default function replaceAll(subject, search, replace) {
   const subjectString = coerceToString(subject);
-  if (search instanceof RegExp) {
-    if (search.flags.indexOf('g') === -1) {
-      throw new TypeError('search argument is a non-global regular expression');
-    }
-    return subjectString.replace(search, replace);
-  }
+  if (search instanceof RegExp) {}
   const searchString = coerceToString(search);
   const isFunctionalReplace = typeof replace === 'function';
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1h1e1l1l1o1"
Received: "hello"

[Killed] ConditionalExpression
src/manipulate/replace_all.js:25:9
 export default function replaceAll(subject, search, replace) {
   const subjectString = coerceToString(subject);
   if (search instanceof RegExp) {
-    if (search.flags.indexOf('g') === -1) {
+    if (true) {
       throw new TypeError('search argument is a non-global regular expression');
     }
killedBy: replaceAll should return the replace result with a string pattern
statusReason: TypeError: search argument is a non-global regular expression

[Killed] UnaryOperator
src/manipulate/replace_all.js:25:39
 export default function replaceAll(subject, search, replace) {
   const subjectString = coerceToString(subject);
   if (search instanceof RegExp) {
-    if (search.flags.indexOf('g') === -1) {
+    if (search.flags.indexOf('g') === +1) {
       throw new TypeError('search argument is a non-global regular expression');
     }
killedBy: replaceAll should throw a type error when the search pattern is non-global
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "search argument is a non-global regular expression"

Received function did not throw

[Killed] ConditionalExpression
src/manipulate/replace_all.js:31:31
     return subjectString.replace(search, replace);
   }
   const searchString = coerceToString(search);
-  const isFunctionalReplace = typeof replace === 'function';
+  const isFunctionalReplace = false;
   if (!isFunctionalReplace) {
     replace = coerceToString(replace);
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- swan swan duc
+ function () {
+       return 'swan';

[Killed] ConditionalExpression
src/manipulate/replace_all.js:31:31
     return subjectString.replace(search, replace);
   }
   const searchString = coerceToString(search);
-  const isFunctionalReplace = typeof replace === 'function';
+  const isFunctionalReplace = true;
   if (!isFunctionalReplace) {
     replace = coerceToString(replace);
killedBy: replaceAll should return the replace result with a string pattern
statusReason: TypeError: replace.call is not a function

[Killed] ConditionalExpression
src/manipulate/replace_all.js:32:7
   }
   const searchString = coerceToString(search);
   const isFunctionalReplace = typeof replace === 'function';
-  if (!isFunctionalReplace) {
+  if (true) {
     replace = coerceToString(replace);
   }
killedBy: replaceAll should return the replace result with a string pattern
statusReason: TypeError: replace.call is not a function

[Killed] BooleanLiteral
src/manipulate/replace_all.js:32:7
   }
   const searchString = coerceToString(search);
   const isFunctionalReplace = typeof replace === 'function';
-  if (!isFunctionalReplace) {
+  if (isFunctionalReplace) {
     replace = coerceToString(replace);
   }
killedBy: replaceAll should return the replace result with a string pattern
statusReason: TypeError: replace.call is not a function

[Killed] ConditionalExpression
src/manipulate/replace_all.js:36:7
     replace = coerceToString(replace);
   }
   const searchLength = searchString.length;
-  if (searchLength === 0) {
+  if (true) {
     return replaceAll(subject, /(?:)/g, replace);
   }
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "swan"
Received: "swandswanuswancswankswan"

[Killed] EqualityOperator
src/manipulate/replace_all.js:36:7
     replace = coerceToString(replace);
   }
   const searchLength = searchString.length;
-  if (searchLength === 0) {
+  if (searchLength !== 0) {
     return replaceAll(subject, /(?:)/g, replace);
   }
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "swan"
Received: "swandswanuswancswankswan"

[Survived] EqualityOperator
src/manipulate/replace_all.js:39:21
   if (searchLength === 0) {
     return replaceAll(subject, /(?:)/g, replace);
   }
-  const advanceBy = searchLength > 1 ? searchLength : 1;
+  const advanceBy = searchLength >= 1 ? searchLength : 1;
   const matchPositions = [];
   let position = subjectString.indexOf(searchString, 0);

[Survived] ConditionalExpression
src/manipulate/replace_all.js:39:21
   if (searchLength === 0) {
     return replaceAll(subject, /(?:)/g, replace);
   }
-  const advanceBy = searchLength > 1 ? searchLength : 1;
+  const advanceBy = false ? searchLength : 1;
   const matchPositions = [];
   let position = subjectString.indexOf(searchString, 0);

[Killed] ArrayDeclaration
src/manipulate/replace_all.js:40:26
     return replaceAll(subject, /(?:)/g, replace);
   }
   const advanceBy = searchLength > 1 ? searchLength : 1;
-  const matchPositions = [];
+  const matchPositions = ["Stryker was here"];
   let position = subjectString.indexOf(searchString, 0);
   while (position !== -1) {
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "swan"
Received: "swanswan"

[Killed] ConditionalExpression
src/manipulate/replace_all.js:42:10
   const advanceBy = searchLength > 1 ? searchLength : 1;
   const matchPositions = [];
   let position = subjectString.indexOf(searchString, 0);
-  while (position !== -1) {
+  while (false) {
     matchPositions.push(position);
     position = subjectString.indexOf(searchString, position + advanceBy);
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "swan"
Received: "duck"

[Timeout] EqualityOperator
src/manipulate/replace_all.js:42:10
   const advanceBy = searchLength > 1 ? searchLength : 1;
   const matchPositions = [];
   let position = subjectString.indexOf(searchString, 0);
-  while (position !== -1) {
+  while (position === -1) {
     matchPositions.push(position);
     position = subjectString.indexOf(searchString, position + advanceBy);

[Timeout] ArithmeticOperator
src/manipulate/replace_all.js:44:52
   let position = subjectString.indexOf(searchString, 0);
   while (position !== -1) {
     matchPositions.push(position);
-    position = subjectString.indexOf(searchString, position + advanceBy);
+    position = subjectString.indexOf(searchString, position - advanceBy);
   }
   let endOfLastMatch = 0;

[Killed] ConditionalExpression
src/manipulate/replace_all.js:48:19
   }
   let endOfLastMatch = 0;
   let result = '';
-  for (let i = 0; i < matchPositions.length; i++) {
+  for (let i = 0; false; i++) {
     const position = matchPositions[i];
     let replacement = replace;
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "swan"
Received: "duck"

[Killed] EqualityOperator
src/manipulate/replace_all.js:48:19
   }
   let endOfLastMatch = 0;
   let result = '';
-  for (let i = 0; i < matchPositions.length; i++) {
+  for (let i = 0; i <= matchPositions.length; i++) {
     const position = matchPositions[i];
     let replacement = replace;
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "swan"
Received: "swanswan"

[Killed] ConditionalExpression
src/manipulate/replace_all.js:51:9
   for (let i = 0; i < matchPositions.length; i++) {
     const position = matchPositions[i];
     let replacement = replace;
-    if (isFunctionalReplace) {
+    if (false) {
       replacement = coerceToString(replace.call(undefined, searchString, position, subjectString));
     }
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- swan swan duc
+ function () {
+       return 'swan';

[Killed] BlockStatement
src/manipulate/replace_all.js:51:30
   for (let i = 0; i < matchPositions.length; i++) {
     const position = matchPositions[i];
     let replacement = replace;
-    if (isFunctionalReplace) {
-      replacement = coerceToString(replace.call(undefined, searchString, position, subjectString));
-    }
+    if (isFunctionalReplace) {}
     result += subjectString.slice(endOfLastMatch, position) + replacement;
     endOfLastMatch = position + searchLength;
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- swan swan duc
+ function () {
+       return 'swan';

[Killed] AssignmentOperator
src/manipulate/replace_all.js:54:5
     if (isFunctionalReplace) {
       replacement = coerceToString(replace.call(undefined, searchString, position, subjectString));
     }
-    result += subjectString.slice(endOfLastMatch, position) + replacement;
+    result -= subjectString.slice(endOfLastMatch, position) + replacement;
     endOfLastMatch = position + searchLength;
   }
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "swan"
Received: NaN

[Killed] ArithmeticOperator
src/manipulate/replace_all.js:54:15
     if (isFunctionalReplace) {
       replacement = coerceToString(replace.call(undefined, searchString, position, subjectString));
     }
-    result += subjectString.slice(endOfLastMatch, position) + replacement;
+    result += subjectString.slice(endOfLastMatch, position) - replacement;
     endOfLastMatch = position + searchLength;
   }
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "swan"
Received: "NaN"

[Killed] ArithmeticOperator
src/manipulate/replace_all.js:55:22
       replacement = coerceToString(replace.call(undefined, searchString, position, subjectString));
     }
     result += subjectString.slice(endOfLastMatch, position) + replacement;
-    endOfLastMatch = position + searchLength;
+    endOfLastMatch = position - searchLength;
   }
   if (endOfLastMatch < subjectString.length) {
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "swan"
Received: "swanduck"

[Killed] EqualityOperator
src/manipulate/replace_all.js:57:7
     result += subjectString.slice(endOfLastMatch, position) + replacement;
     endOfLastMatch = position + searchLength;
   }
-  if (endOfLastMatch < subjectString.length) {
+  if (endOfLastMatch >= subjectString.length) {
     result += subjectString.slice(endOfLastMatch);
   }
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dddduucckk"
Received: "dddd"

[Killed] BlockStatement
src/manipulate/replace_all.js:57:46
     result += subjectString.slice(endOfLastMatch, position) + replacement;
     endOfLastMatch = position + searchLength;
   }
-  if (endOfLastMatch < subjectString.length) {
-    result += subjectString.slice(endOfLastMatch);
-  }
+  if (endOfLastMatch < subjectString.length) {}
   return result;
 }
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dddduucckk"
Received: "dddd"

[Killed] AssignmentOperator
src/manipulate/replace_all.js:58:5
     endOfLastMatch = position + searchLength;
   }
   if (endOfLastMatch < subjectString.length) {
-    result += subjectString.slice(endOfLastMatch);
+    result -= subjectString.slice(endOfLastMatch);
   }
   return result;
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dddduucckk"
Received: NaN

[Killed] MethodExpression
src/manipulate/replace_all.js:58:15
     endOfLastMatch = position + searchLength;
   }
   if (endOfLastMatch < subjectString.length) {
-    result += subjectString.slice(endOfLastMatch);
+    result += subjectString;
   }
   return result;
killedBy: replaceAll should return the replace result with a string pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dddduucckk"
Received: "dddddduucckk"
