[Killed] ConditionalExpression
src/strip/strip_tags.js:35:7
  */
 export default function trim(subject, allowableTags, replacement) {
   subject = coerceToString(subject);
-  if (subject === '') {
+  if (true) {
     return '';
   }
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: ""

[Killed] EqualityOperator
src/strip/strip_tags.js:35:7
  */
 export default function trim(subject, allowableTags, replacement) {
   subject = coerceToString(subject);
-  if (subject === '') {
+  if (subject !== '') {
     return '';
   }
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: ""

[Killed] StringLiteral
src/strip/strip_tags.js:36:12
 export default function trim(subject, allowableTags, replacement) {
   subject = coerceToString(subject);
   if (subject === '') {
-    return '';
+    return "Stryker was here!";
   }
   if (!Array.isArray(allowableTags)) {
killedBy: stripTags should not modify a string without tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] ConditionalExpression
src/strip/strip_tags.js:38:7
   if (subject === '') {
     return '';
   }
-  if (!Array.isArray(allowableTags)) {
+  if (false) {
     const allowableTagsString = coerceToString(allowableTags);
     allowableTags = allowableTagsString === '' ? [] : parseTagList(allowableTagsString);
killedBy: stripTags should strip tags
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BooleanLiteral
src/strip/strip_tags.js:38:7
   if (subject === '') {
     return '';
   }
-  if (!Array.isArray(allowableTags)) {
+  if (Array.isArray(allowableTags)) {
     const allowableTagsString = coerceToString(allowableTags);
     allowableTags = allowableTagsString === '' ? [] : parseTagList(allowableTagsString);
killedBy: stripTags should strip tags
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/strip/strip_tags.js:40:21
   }
   if (!Array.isArray(allowableTags)) {
     const allowableTagsString = coerceToString(allowableTags);
-    allowableTags = allowableTagsString === '' ? [] : parseTagList(allowableTagsString);
+    allowableTags = allowableTagsString !== '' ? [] : parseTagList(allowableTagsString);
   }
   const replacementString = coerceToString(replacement);
killedBy: stripTags should strip tags on multiple lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- <html>This's a string with quotes:</html>
+ This's a string with quotes:
  "strings in double quote";

[Killed] ConditionalExpression
src/strip/strip_tags.js:40:21
   }
   if (!Array.isArray(allowableTags)) {
     const allowableTagsString = coerceToString(allowableTags);
-    allowableTags = allowableTagsString === '' ? [] : parseTagList(allowableTagsString);
+    allowableTags = true ? [] : parseTagList(allowableTagsString);
   }
   const replacementString = coerceToString(replacement);
killedBy: stripTags should strip tags on multiple lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- <html>This's a string with quotes:</html>
+ This's a string with quotes:
  "strings in double quote";

[Killed] ConditionalExpression
src/strip/strip_tags.js:44:28
   }
   const replacementString = coerceToString(replacement);
   const length = subject.length;
-  const hasAllowableTags = allowableTags.length > 0;
+  const hasAllowableTags = false;
   const hasSubstring = hasSubstringAtIndex.bind(null, subject);
   let state = STATE_OUTPUT;
killedBy: stripTags should strip tags on multiple lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- <html>This's a string with quotes:</html>
+ This's a string with quotes:
  "strings in double quote";

[Killed] EqualityOperator
src/strip/strip_tags.js:44:28
   }
   const replacementString = coerceToString(replacement);
   const length = subject.length;
-  const hasAllowableTags = allowableTags.length > 0;
+  const hasAllowableTags = allowableTags.length <= 0;
   const hasSubstring = hasSubstringAtIndex.bind(null, subject);
   let state = STATE_OUTPUT;
killedBy: stripTags should strip tags on multiple lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- <html>This's a string with quotes:</html>
+ This's a string with quotes:
  "strings in double quote";

[Killed] ConditionalExpression
src/strip/strip_tags.js:51:23
   let output = '';
   let tagContent = '';
   let quote = null;
-  for (let index = 0; index < length; index++) {
+  for (let index = 0; false; index++) {
     const char = subject[index];
     let advance = false;
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: ""

[Killed] EqualityOperator
src/strip/strip_tags.js:51:23
   let output = '';
   let tagContent = '';
   let quote = null;
-  for (let index = 0; index < length; index++) {
+  for (let index = 0; index >= length; index++) {
     const char = subject[index];
     let advance = false;
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: ""

[Killed] BooleanLiteral
src/strip/strip_tags.js:53:19
   let quote = null;
   for (let index = 0; index < length; index++) {
     const char = subject[index];
-    let advance = false;
+    let advance = true;
     switch (char) {
       case '<':
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: ">Hello world!>"

[Killed] ConditionalExpression
src/strip/strip_tags.js:55:7
     const char = subject[index];
     let advance = false;
     switch (char) {
-      case '<':
-        if (quote) {
-          break;
-        }
-        if (hasSubstring('< ', index, false)) {
-          advance = true;
-          break;
-        }
-        if (state === STATE_OUTPUT) {
-          advance = true;
-          state = STATE_HTML;
-          break;
-        }
-        if (state === STATE_HTML) {
-          depth++;
-          break;
-        }
-        advance = true;
-        break;
+      case '<':
       case '!':
         if (state === STATE_HTML && hasSubstring('<!', index)) {
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: "<b>Hello world!</b>"

[Killed] StringLiteral
src/strip/strip_tags.js:55:12
     const char = subject[index];
     let advance = false;
     switch (char) {
-      case '<':
+      case "":
         if (quote) {
           break;
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: "<b>Hello world!</b>"

[Killed] BlockStatement
src/strip/strip_tags.js:56:20
     let advance = false;
     switch (char) {
       case '<':
-        if (quote) {
-          break;
-        }
+        if (quote) {}
         if (hasSubstring('< ', index, false)) {
           advance = true;
killedBy: stripTags should strip tags which attributes contain < or > 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello  world"
Received: "hello "

[Killed] ConditionalExpression
src/strip/strip_tags.js:56:13
     let advance = false;
     switch (char) {
       case '<':
-        if (quote) {
+        if (false) {
           break;
         }
killedBy: stripTags should strip tags which attributes contain < or > 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello  world"
Received: "hello "

[Killed] ConditionalExpression
src/strip/strip_tags.js:59:13
         if (quote) {
           break;
         }
-        if (hasSubstring('< ', index, false)) {
+        if (false) {
           advance = true;
           break;
killedBy: stripTags should treat especially broken or invalid tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "< html >"
Received: ""

[Killed] BlockStatement
src/strip/strip_tags.js:59:47
         if (quote) {
           break;
         }
-        if (hasSubstring('< ', index, false)) {
-          advance = true;
-          break;
-        }
+        if (hasSubstring('< ', index, false)) {}
         if (state === STATE_OUTPUT) {
           advance = true;
killedBy: stripTags should treat especially broken or invalid tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "< html >"
Received: ""

[Killed] BooleanLiteral
src/strip/strip_tags.js:60:21
           break;
         }
         if (hasSubstring('< ', index, false)) {
-          advance = true;
+          advance = false;
           break;
         }
killedBy: stripTags should treat especially broken or invalid tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "< html >"
Received: " html >"

[Killed] ConditionalExpression
src/strip/strip_tags.js:63:13
           advance = true;
           break;
         }
-        if (state === STATE_OUTPUT) {
+        if (false) {
           advance = true;
           state = STATE_HTML;
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: "<b>Hello world!</b>"

[Killed] BlockStatement
src/strip/strip_tags.js:63:37
           advance = true;
           break;
         }
-        if (state === STATE_OUTPUT) {
-          advance = true;
-          state = STATE_HTML;
-          break;
-        }
+        if (state === STATE_OUTPUT) {}
         if (state === STATE_HTML) {
           depth++;
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: "<b>Hello world!</b>"

[Killed] BooleanLiteral
src/strip/strip_tags.js:64:21
           break;
         }
         if (state === STATE_OUTPUT) {
-          advance = true;
+          advance = false;
           state = STATE_HTML;
           break;
killedBy: stripTags should strip tags on multiple lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- <html>This's a string with quotes:</html>
+ html>This's a string with quotes:/html>
  "strings in double quote";

[Killed] BlockStatement
src/strip/strip_tags.js:68:35
           state = STATE_HTML;
           break;
         }
-        if (state === STATE_HTML) {
-          depth++;
-          break;
-        }
+        if (state === STATE_HTML) {}
         advance = true;
         break;
killedBy: stripTags should strip potential xss tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "alert(\"XSS\");//"

[Killed] EqualityOperator
src/strip/strip_tags.js:68:13
           state = STATE_HTML;
           break;
         }
-        if (state === STATE_HTML) {
+        if (state !== STATE_HTML) {
           depth++;
           break;
killedBy: stripTags should strip potential xss tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "alert(\"XSS\");//"

[Killed] UpdateOperator
src/strip/strip_tags.js:69:11
           break;
         }
         if (state === STATE_HTML) {
-          depth++;
+          depth--;
           break;
         }
killedBy: stripTags should strip potential xss tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "alert(\"XSS\");//"

[Survived] BooleanLiteral
src/strip/strip_tags.js:72:19
           depth++;
           break;
         }
-        advance = true;
+        advance = false;
         break;
       case '!':

[Survived] ConditionalExpression
src/strip/strip_tags.js:74:7
         }
         advance = true;
         break;
-      case '!':
-        if (state === STATE_HTML && hasSubstring('<!', index)) {
-          state = STATE_EXCLAMATION;
-          break;
-        }
-        advance = true;
-        break;
+      case '!':
       case '-':
         if (state === STATE_EXCLAMATION && hasSubstring('!--', index)) {

[Killed] ConditionalExpression
src/strip/strip_tags.js:75:13
         advance = true;
         break;
       case '!':
-        if (state === STATE_HTML && hasSubstring('<!', index)) {
+        if (true) {
           state = STATE_EXCLAMATION;
           break;
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: "Hello world"

[Survived] EqualityOperator
src/strip/strip_tags.js:75:13
         advance = true;
         break;
       case '!':
-        if (state === STATE_HTML && hasSubstring('<!', index)) {
+        if (state !== STATE_HTML && hasSubstring('<!', index)) {
           state = STATE_EXCLAMATION;
           break;

[Killed] ConditionalExpression
src/strip/strip_tags.js:81:7
         }
         advance = true;
         break;
-      case '-':
-        if (state === STATE_EXCLAMATION && hasSubstring('!--', index)) {
-          state = STATE_COMMENT;
-          break;
-        }
-        advance = true;
-        break;
+      case '-':
       case '"':
       case "'":
killedBy: stripTags should strip comments and doctype
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: "comment -->Hello world!"

[Killed] EqualityOperator
src/strip/strip_tags.js:82:13
         advance = true;
         break;
       case '-':
-        if (state === STATE_EXCLAMATION && hasSubstring('!--', index)) {
+        if (state !== STATE_EXCLAMATION && hasSubstring('!--', index)) {
           state = STATE_COMMENT;
           break;
killedBy: stripTags should strip comments and doctype
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: "comment -->Hello world!"

[Killed] ConditionalExpression
src/strip/strip_tags.js:82:13
         advance = true;
         break;
       case '-':
-        if (state === STATE_EXCLAMATION && hasSubstring('!--', index)) {
+        if (false) {
           state = STATE_COMMENT;
           break;
killedBy: stripTags should strip comments and doctype
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: "comment -->Hello world!"

[Killed] ConditionalExpression
src/strip/strip_tags.js:89:7
         advance = true;
         break;
       case '"':
-      case "'":
-        if (state === STATE_HTML) {
-          if (quote === char) {
-            quote = null;
-          } else if (!quote) {
-            quote = char;
-          }
-        }
-        advance = true;
-        break;
+      case "'":
       case 'E':
       case 'e':
killedBy: stripTags should strip potential xss tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "alert(\"XSS\")\">"

[Killed] StringLiteral
src/strip/strip_tags.js:89:12
         advance = true;
         break;
       case '"':
-      case "'":
+      case "":
         if (state === STATE_HTML) {
           if (quote === char) {
killedBy: stripTags should strip tags which attributes contain < or > 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello  world"
Received: "hello _ world"

[Killed] BlockStatement
src/strip/strip_tags.js:90:35
         break;
       case '"':
       case "'":
-        if (state === STATE_HTML) {
-          if (quote === char) {
-            quote = null;
-          } else if (!quote) {
-            quote = char;
-          }
-        }
+        if (state === STATE_HTML) {}
         advance = true;
         break;
killedBy: stripTags should strip potential xss tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "alert(\"XSS\")\">"

[Killed] ConditionalExpression
src/strip/strip_tags.js:90:13
         break;
       case '"':
       case "'":
-        if (state === STATE_HTML) {
+        if (true) {
           if (quote === char) {
             quote = null;
killedBy: stripTags should strip potential xss tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "document.write(\""
Received: "document.write(\"SCRI\");PT SRC=\"httx://xss.rocks/xss.js\">"

[Killed] ConditionalExpression
src/strip/strip_tags.js:91:15
       case '"':
       case "'":
         if (state === STATE_HTML) {
-          if (quote === char) {
+          if (false) {
             quote = null;
           } else if (!quote) {
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: ""

[Killed] ConditionalExpression
src/strip/strip_tags.js:91:15
       case '"':
       case "'":
         if (state === STATE_HTML) {
-          if (quote === char) {
+          if (true) {
             quote = null;
           } else if (!quote) {
killedBy: stripTags should strip potential xss tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "alert(\"XSS\")\">"

[Killed] ConditionalExpression
src/strip/strip_tags.js:93:22
         if (state === STATE_HTML) {
           if (quote === char) {
             quote = null;
-          } else if (!quote) {
+          } else if (true) {
             quote = char;
           }
killedBy: stripTags should strip tags which attributes contain < or > 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello  world"
Received: "hello "

[Killed] ConditionalExpression
src/strip/strip_tags.js:93:22
         if (state === STATE_HTML) {
           if (quote === char) {
             quote = null;
-          } else if (!quote) {
+          } else if (false) {
             quote = char;
           }
killedBy: stripTags should strip potential xss tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "alert(\"XSS\")\">"

[Killed] ConditionalExpression
src/strip/strip_tags.js:100:7
         advance = true;
         break;
       case 'E':
-      case 'e':
-        if (state === STATE_EXCLAMATION && hasSubstring('doctype', index)) {
-          state = STATE_HTML;
-          break;
-        }
-        advance = true;
-        break;
+      case 'e':
       case '>':
         if (depth > 0) {
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: " echo hello "
Received: "=\"PHP\"> echo hello "

[Killed] ConditionalExpression
src/strip/strip_tags.js:101:13
         break;
       case 'E':
       case 'e':
-        if (state === STATE_EXCLAMATION && hasSubstring('doctype', index)) {
+        if (true) {
           state = STATE_HTML;
           break;
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: "H"

[Survived] ConditionalExpression
src/strip/strip_tags.js:101:13
         break;
       case 'E':
       case 'e':
-        if (state === STATE_EXCLAMATION && hasSubstring('doctype', index)) {
+        if (false) {
           state = STATE_HTML;
           break;

[Killed] BlockStatement
src/strip/strip_tags.js:108:24
         advance = true;
         break;
       case '>':
-        if (depth > 0) {
-          depth--;
-          break;
-        }
+        if (depth > 0) {}
         if (quote) {
           break;
killedBy: stripTags should strip potential xss tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "alert(\"XSS\");//"

[Killed] ConditionalExpression
src/strip/strip_tags.js:108:13
         advance = true;
         break;
       case '>':
-        if (depth > 0) {
+        if (true) {
           depth--;
           break;
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: ""

[Killed] UpdateOperator
src/strip/strip_tags.js:109:11
         break;
       case '>':
         if (depth > 0) {
-          depth--;
+          depth++;
           break;
         }
killedBy: stripTags should treat especially broken or invalid tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<htmL>hello</htmL>"
Received: ""

[Killed] BlockStatement
src/strip/strip_tags.js:112:20
           depth--;
           break;
         }
-        if (quote) {
-          break;
-        }
+        if (quote) {}
         if (state === STATE_HTML) {
           quote = null;
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: "\">Hello world!"

[Killed] ConditionalExpression
src/strip/strip_tags.js:112:13
           depth--;
           break;
         }
-        if (quote) {
+        if (false) {
           break;
         }
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: "\">Hello world!"

[Killed] BlockStatement
src/strip/strip_tags.js:115:35
         if (quote) {
           break;
         }
-        if (state === STATE_HTML) {
-          quote = null;
-          state = STATE_OUTPUT;
-          if (hasAllowableTags) {
-            tagContent += '>';
-            const tagName = parseTagName(tagContent);
-            if (allowableTags.indexOf(tagName.toLowerCase()) !== -1) {
-              output += tagContent;
-            } else {
-              output += replacementString;
-            }
-            tagContent = '';
-          } else {
-            output += replacementString;
-          }
-          break;
-        }
+        if (state === STATE_HTML) {}
         if (state === STATE_EXCLAMATION || (state === STATE_COMMENT && hasSubstring('-->', index))) {
           quote = null;
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: ""

[Killed] ConditionalExpression
src/strip/strip_tags.js:115:13
         if (quote) {
           break;
         }
-        if (state === STATE_HTML) {
+        if (false) {
           quote = null;
           state = STATE_OUTPUT;
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: ""

[Killed] BlockStatement
src/strip/strip_tags.js:118:33
         if (state === STATE_HTML) {
           quote = null;
           state = STATE_OUTPUT;
-          if (hasAllowableTags) {
-            tagContent += '>';
-            const tagName = parseTagName(tagContent);
-            if (allowableTags.indexOf(tagName.toLowerCase()) !== -1) {
-              output += tagContent;
-            } else {
-              output += replacementString;
-            }
-            tagContent = '';
-          } else {
+          if (hasAllowableTags) {} else {
             output += replacementString;
           }
killedBy: stripTags should strip tags on multiple lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- <html>This's a string with quotes:</html>
+ This's a string with quotes:
  "strings in double quote";

[Killed] ConditionalExpression
src/strip/strip_tags.js:118:15
         if (state === STATE_HTML) {
           quote = null;
           state = STATE_OUTPUT;
-          if (hasAllowableTags) {
+          if (false) {
             tagContent += '>';
             const tagName = parseTagName(tagContent);
killedBy: stripTags should strip tags on multiple lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- <html>This's a string with quotes:</html>
+ This's a string with quotes:
  "strings in double quote";

[Killed] UnaryOperator
src/strip/strip_tags.js:121:66
           if (hasAllowableTags) {
             tagContent += '>';
             const tagName = parseTagName(tagContent);
-            if (allowableTags.indexOf(tagName.toLowerCase()) !== -1) {
+            if (allowableTags.indexOf(tagName.toLowerCase()) !== +1) {
               output += tagContent;
             } else {
killedBy: stripTags should not strip allowable tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<b class=\"red\">Hello</b> world!"
Received: "<b class=\"red\">Hello</b> <span>world!</span>"

[Killed] ConditionalExpression
src/strip/strip_tags.js:121:17
           if (hasAllowableTags) {
             tagContent += '>';
             const tagName = parseTagName(tagContent);
-            if (allowableTags.indexOf(tagName.toLowerCase()) !== -1) {
+            if (false) {
               output += tagContent;
             } else {
killedBy: stripTags should strip tags on multiple lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- <html>This's a string with quotes:</html>
+ This's a string with quotes:
  "strings in double quote";

[Killed] AssignmentOperator
src/strip/strip_tags.js:122:15
             tagContent += '>';
             const tagName = parseTagName(tagContent);
             if (allowableTags.indexOf(tagName.toLowerCase()) !== -1) {
-              output += tagContent;
+              output -= tagContent;
             } else {
               output += replacementString;
killedBy: stripTags should strip tags on multiple lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<html>This's a string with quotes:</html>
\"strings in double quote\";
'strings in single quote';
<html>thisline is single quoted /withslashes </html>"
Received: NaN

[Killed] BlockStatement
src/strip/strip_tags.js:123:20
             const tagName = parseTagName(tagContent);
             if (allowableTags.indexOf(tagName.toLowerCase()) !== -1) {
               output += tagContent;
-            } else {
-              output += replacementString;
-            }
+            } else {}
             tagContent = '';
           } else {
killedBy: stripTags should add instead of stripped tags a special string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: " Hello  World "
Received: "HelloWorld"

[Killed] AssignmentOperator
src/strip/strip_tags.js:124:15
             if (allowableTags.indexOf(tagName.toLowerCase()) !== -1) {
               output += tagContent;
             } else {
-              output += replacementString;
+              output -= replacementString;
             }
             tagContent = '';
killedBy: stripTags should not strip allowable tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<b class=\"red\">Hello</b> world!"
Received: NaN

[Killed] StringLiteral
src/strip/strip_tags.js:126:26
             } else {
               output += replacementString;
             }
-            tagContent = '';
+            tagContent = "Stryker was here!";
           } else {
             output += replacementString;
killedBy: stripTags should strip tags on multiple lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- <html>This's a string with quotes:</html>
+ <html>This's a string with quotes:
  "strings in double quote";

[Killed] BlockStatement
src/strip/strip_tags.js:127:18
               output += replacementString;
             }
             tagContent = '';
-          } else {
-            output += replacementString;
-          }
+          } else {}
           break;
         }
killedBy: stripTags should add instead of stripped tags a special string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "***Recently improved articles***"
Received: "Recently improved articles"

[Killed] EqualityOperator
src/strip/strip_tags.js:132:13
           }
           break;
         }
-        if (state === STATE_EXCLAMATION || (state === STATE_COMMENT && hasSubstring('-->', index))) {
+        if (state !== STATE_EXCLAMATION || (state === STATE_COMMENT && hasSubstring('-->', index))) {
           quote = null;
           state = STATE_OUTPUT;
killedBy: stripTags should strip potential xss tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "` SRC=\"httx://xss.rocks/xss.js\">"
Received: "` SRC=\"httx://xss.rocks/xss.js\""

[Killed] LogicalOperator
src/strip/strip_tags.js:132:13
           }
           break;
         }
-        if (state === STATE_EXCLAMATION || (state === STATE_COMMENT && hasSubstring('-->', index))) {
+        if (state === STATE_EXCLAMATION && state === STATE_COMMENT && hasSubstring('-->', index)) {
           quote = null;
           state = STATE_OUTPUT;
killedBy: stripTags should strip comments and doctype
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: ""

[Timeout] ConditionalExpression
src/strip/strip_tags.js:140:7
         }
         advance = true;
         break;
-      default:
-        advance = true;
+      default:
     }
     if (advance) {
