[Killed] BooleanLiteral
src/strip/strip_tags.js:141:19
         advance = true;
         break;
       default:
-        advance = true;
+        advance = false;
     }
     if (advance) {
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: "e!"

[Killed] ConditionalExpression
src/strip/strip_tags.js:143:9
       default:
         advance = true;
     }
-    if (advance) {
+    if (true) {
       switch (state) {
         case STATE_OUTPUT:
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: ">Hello world!>"

[Timeout] BlockStatement
src/strip/strip_tags.js:143:18
       default:
         advance = true;
     }
-    if (advance) {
-      switch (state) {
-        case STATE_OUTPUT:
-          output += char;
-          break;
-        case STATE_HTML:
-          if (hasAllowableTags) {
-            tagContent += char;
-          }
-          break;
-      }
-    }
+    if (advance) {}
   }
   return output;

[Killed] ConditionalExpression
src/strip/strip_tags.js:145:9
     }
     if (advance) {
       switch (state) {
-        case STATE_OUTPUT:
-          output += char;
-          break;
+        case STATE_OUTPUT:
         case STATE_HTML:
           if (hasAllowableTags) {
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: ""

[Killed] AssignmentOperator
src/strip/strip_tags.js:146:11
     if (advance) {
       switch (state) {
         case STATE_OUTPUT:
-          output += char;
+          output -= char;
           break;
         case STATE_HTML:
killedBy: stripTags should strip tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world!"
Received: "NaN"

[Killed] ConditionalExpression
src/strip/strip_tags.js:148:9
         case STATE_OUTPUT:
           output += char;
           break;
-        case STATE_HTML:
-          if (hasAllowableTags) {
-            tagContent += char;
-          }
-          break;
+        case STATE_HTML:
       }
     }
killedBy: stripTags should strip tags on multiple lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- <html>This's a string with quotes:</html>
+ This's a string with quotes:
  "strings in double quote";

[Killed] ConditionalExpression
src/strip/strip_tags.js:149:15
           output += char;
           break;
         case STATE_HTML:
-          if (hasAllowableTags) {
+          if (false) {
             tagContent += char;
           }
killedBy: stripTags should strip tags on multiple lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- <html>This's a string with quotes:</html>
+ This's a string with quotes:
  "strings in double quote";

[Killed] BlockStatement
src/strip/strip_tags.js:149:33
           output += char;
           break;
         case STATE_HTML:
-          if (hasAllowableTags) {
-            tagContent += char;
-          }
+          if (hasAllowableTags) {}
           break;
       }
killedBy: stripTags should strip tags on multiple lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- <html>This's a string with quotes:</html>
+ This's a string with quotes:
  "strings in double quote";

[Killed] AssignmentOperator
src/strip/strip_tags.js:150:13
           break;
         case STATE_HTML:
           if (hasAllowableTags) {
-            tagContent += char;
+            tagContent -= char;
           }
           break;
killedBy: stripTags should strip tags on multiple lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected
+ Received

- <html>This's a string with quotes:</html>
+ This's a string with quotes:
  "strings in double quote";
