[Killed] BlockStatement
src/manipulate/tr.js:40:39
   const subjectString = coerceToString(subject);
   let keys;
   let values;
-  if (isString(from) && isString(to)) {
-    keys = from.split('');
-    values = to.split('');
-  } else {
+  if (isString(from) && isString(to)) {} else {
     [keys, values] = extractKeysAndValues(nilDefault(from, {}));
   }
killedBy: tr should translate the string from characters to characters
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/manipulate/tr.js:40:7
   const subjectString = coerceToString(subject);
   let keys;
   let values;
-  if (isString(from) && isString(to)) {
+  if (true) {
     keys = from.split('');
     values = to.split('');
killedBy: tr should translate the string from a map object
statusReason: TypeError: from.split is not a function

[Killed] StringLiteral
src/manipulate/tr.js:41:23
   let keys;
   let values;
   if (isString(from) && isString(to)) {
-    keys = from.split('');
+    keys = from.split("Stryker was here!");
     values = to.split('');
   } else {
killedBy: tr should translate the string from characters to characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hippo"
Received: "hilo"

[Killed] StringLiteral
src/manipulate/tr.js:42:23
   let values;
   if (isString(from) && isString(to)) {
     keys = from.split('');
-    values = to.split('');
+    values = to.split("Stryker was here!");
   } else {
     [keys, values] = extractKeysAndValues(nilDefault(from, {}));
killedBy: tr should translate the string from characters to characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hippo"
Received: "hipllo"

[Killed] BlockStatement
src/manipulate/tr.js:43:10
   if (isString(from) && isString(to)) {
     keys = from.split('');
     values = to.split('');
-  } else {
-    [keys, values] = extractKeysAndValues(nilDefault(from, {}));
-  }
+  } else {}
   const keysLength = keys.length;
   // Stryker disable next-line all
killedBy: tr should translate the string from a map object
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/manipulate/tr.js:53:23
   }
   let result = '';
   const valuesLength = values.length;
-  for (let index = 0; index < subjectString.length; index++) {
+  for (let index = 0; false; index++) {
     let isMatch = false;
     let matchValue;
killedBy: tr should translate the string from characters to characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bbc"
Received: ""

[Killed] EqualityOperator
src/manipulate/tr.js:53:23
   }
   let result = '';
   const valuesLength = values.length;
-  for (let index = 0; index < subjectString.length; index++) {
+  for (let index = 0; index >= subjectString.length; index++) {
     let isMatch = false;
     let matchValue;
killedBy: tr should translate the string from characters to characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bbc"
Received: ""

[Killed] BooleanLiteral
src/manipulate/tr.js:54:19
   let result = '';
   const valuesLength = values.length;
   for (let index = 0; index < subjectString.length; index++) {
-    let isMatch = false;
+    let isMatch = true;
     let matchValue;
     for (let keyIndex = 0; keyIndex < keysLength && keyIndex < valuesLength; keyIndex++) {
killedBy: tr should translate the string from characters to characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bbc"
Received: "bundefinedundefined"

[Killed] EqualityOperator
src/manipulate/tr.js:56:53
   for (let index = 0; index < subjectString.length; index++) {
     let isMatch = false;
     let matchValue;
-    for (let keyIndex = 0; keyIndex < keysLength && keyIndex < valuesLength; keyIndex++) {
+    for (let keyIndex = 0; keyIndex < keysLength && keyIndex >= valuesLength; keyIndex++) {
       const key = keys[keyIndex];
       if (subjectString.substr(index, key.length) === key) {
killedBy: tr should translate the string from characters to characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bbc"
Received: "abc"

[Killed] BlockStatement
src/manipulate/tr.js:56:90
   for (let index = 0; index < subjectString.length; index++) {
     let isMatch = false;
     let matchValue;
-    for (let keyIndex = 0; keyIndex < keysLength && keyIndex < valuesLength; keyIndex++) {
-      const key = keys[keyIndex];
-      if (subjectString.substr(index, key.length) === key) {
-        isMatch = true;
-        matchValue = values[keyIndex];
-        index = index + key.length - 1;
-        break;
-      }
-    }
+    for (let keyIndex = 0; keyIndex < keysLength && keyIndex < valuesLength; keyIndex++) {}
     result += isMatch ? matchValue : subjectString[index];
   }
killedBy: tr should translate the string from characters to characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bbc"
Received: "abc"

[Killed] EqualityOperator
src/manipulate/tr.js:58:11
     let matchValue;
     for (let keyIndex = 0; keyIndex < keysLength && keyIndex < valuesLength; keyIndex++) {
       const key = keys[keyIndex];
-      if (subjectString.substr(index, key.length) === key) {
+      if (subjectString.substr(index, key.length) !== key) {
         isMatch = true;
         matchValue = values[keyIndex];
killedBy: tr should translate the string from characters to characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bbc"
Received: "abb"

[Killed] BlockStatement
src/manipulate/tr.js:58:60
     let matchValue;
     for (let keyIndex = 0; keyIndex < keysLength && keyIndex < valuesLength; keyIndex++) {
       const key = keys[keyIndex];
-      if (subjectString.substr(index, key.length) === key) {
-        isMatch = true;
-        matchValue = values[keyIndex];
-        index = index + key.length - 1;
-        break;
-      }
+      if (subjectString.substr(index, key.length) === key) {}
     }
     result += isMatch ? matchValue : subjectString[index];
killedBy: tr should translate the string from characters to characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bbc"
Received: "abc"

[Killed] BooleanLiteral
src/manipulate/tr.js:59:19
     for (let keyIndex = 0; keyIndex < keysLength && keyIndex < valuesLength; keyIndex++) {
       const key = keys[keyIndex];
       if (subjectString.substr(index, key.length) === key) {
-        isMatch = true;
+        isMatch = false;
         matchValue = values[keyIndex];
         index = index + key.length - 1;
killedBy: tr should translate the string from characters to characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bbc"
Received: "abc"

[Killed] ArithmeticOperator
src/manipulate/tr.js:61:17
       if (subjectString.substr(index, key.length) === key) {
         isMatch = true;
         matchValue = values[keyIndex];
-        index = index + key.length - 1;
+        index = index + key.length + 1;
         break;
       }
killedBy: tr should translate the string from characters to characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bbc"
Received: "b"

[Timeout] ArithmeticOperator
src/manipulate/tr.js:61:17
       if (subjectString.substr(index, key.length) === key) {
         isMatch = true;
         matchValue = values[keyIndex];
-        index = index + key.length - 1;
+        index = index - key.length - 1;
         break;
       }

[Killed] AssignmentOperator
src/manipulate/tr.js:65:5
         break;
       }
     }
-    result += isMatch ? matchValue : subjectString[index];
+    result -= isMatch ? matchValue : subjectString[index];
   }
   return result;
killedBy: tr should translate the string from characters to characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bbc"
Received: NaN

[Killed] BlockStatement
src/manipulate/tr.js:70:39
   return result;
 }
 
-function extractKeysAndValues(object) {
-  const keys = Object.keys(object);
-  const values = keys.sort(sortStringByLength).map(function(key) {
-    return object[key];
-  });
-  return [keys, values];
-}
+function extractKeysAndValues(object) {}
 
 function sortStringByLength(str1, str2) {
killedBy: tr should translate the string from a map object
statusReason: TypeError: Invalid attempt to destructure non-iterable instance.
In order to be iterable, non-array objects must have a [Symbol.iterator]() method.

[Killed] MethodExpression
src/manipulate/tr.js:72:18
 
 function extractKeysAndValues(object) {
   const keys = Object.keys(object);
-  const values = keys.sort(sortStringByLength).map(function(key) {
+  const values = keys.map(function(key) {
     return object[key];
   });
killedBy: tr should translate the string from a map object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "My name is Dave, not Steve."
Received: "My name is Dave, not Dave2."

[Killed] BlockStatement
src/manipulate/tr.js:72:66
 
 function extractKeysAndValues(object) {
   const keys = Object.keys(object);
-  const values = keys.sort(sortStringByLength).map(function(key) {
-    return object[key];
-  });
+  const values = keys.sort(sortStringByLength).map(function(key) {});
   return [keys, values];
 }
killedBy: tr should translate the string from a map object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "TEST STrTr"
Received: "undefinedundefinedundefined undefinedrundefinedr"

[Killed] BlockStatement
src/manipulate/tr.js:78:41
   return [keys, values];
 }
 
-function sortStringByLength(str1, str2) {
-  if (str1.length === str2.length) {
-    return 0;
-  }
-  return str1.length < str2.length ? 1 : -1;
-}
+function sortStringByLength(str1, str2) {}
 
killedBy: tr should translate the string from a map object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "My name is Dave, not Steve."
Received: "My name is Dave, not Dave2."

[Killed] EqualityOperator
src/manipulate/tr.js:79:7
 }
 
 function sortStringByLength(str1, str2) {
-  if (str1.length === str2.length) {
+  if (str1.length !== str2.length) {
     return 0;
   }
killedBy: tr should translate the string from a map object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "My name is Dave, not Steve."
Received: "My name is Dave, not Dave2."

[Killed] ConditionalExpression
src/manipulate/tr.js:79:7
 }
 
 function sortStringByLength(str1, str2) {
-  if (str1.length === str2.length) {
+  if (true) {
     return 0;
   }
killedBy: tr should translate the string from a map object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "My name is Dave, not Steve."
Received: "My name is Dave, not Dave2."

[Killed] ConditionalExpression
src/manipulate/tr.js:82:10
   if (str1.length === str2.length) {
     return 0;
   }
-  return str1.length < str2.length ? 1 : -1;
+  return true ? 1 : -1;
 }
 
killedBy: tr should translate the string from a map object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "My name is Dave, not Steve."
Received: "My name is Dave, not Dave2."

[Killed] EqualityOperator
src/manipulate/tr.js:82:10
   if (str1.length === str2.length) {
     return 0;
   }
-  return str1.length < str2.length ? 1 : -1;
+  return str1.length >= str2.length ? 1 : -1;
 }
 
killedBy: tr should translate the string from a map object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "My name is Dave, not Steve."
Received: "My name is Dave, not Dave2."
